experiment/results/compare_low_RPS/no_istio_20260101_024147/wrk_logs/wrk_200rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 97.971ms, rate sampling interval: 625ms
  Thread calibration: mean lat.: 88.999ms, rate sampling interval: 558ms
  Thread calibration: mean lat.: 84.101ms, rate sampling interval: 513ms
  Thread calibration: mean lat.: 90.641ms, rate sampling interval: 544ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    94.95ms  135.41ms 519.93ms   83.40%
    Req/Sec    49.15      9.23    73.00     73.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.55ms
 75.000%  170.62ms
 90.000%  297.21ms
 99.000%  519.93ms
 99.900%  745.98ms
 99.990%  900.09ms
 99.999%    1.05s 
100.000%    1.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.769     0.000000            1         1.00
       2.025     0.100000         1588         1.11
       2.359     0.200000         3176         1.25
       2.981     0.300000         4766         1.43
       4.427     0.400000         6353         1.67
       5.551     0.500000         7939         2.00
       6.607     0.550000         8733         2.22
      23.119     0.600000         9527         2.50
     123.327     0.650000        10326         2.86
     145.407     0.700000        11116         3.33
     170.623     0.750000        11913         4.00
     185.855     0.775000        12306         4.44
     203.135     0.800000        12704         5.00
     222.847     0.825000        13101         5.71
     244.351     0.850000        13499         6.67
     269.567     0.875000        13896         8.00
     282.111     0.887500        14094         8.89
     297.215     0.900000        14291        10.00
     314.367     0.912500        14492        11.43
     332.543     0.925000        14689        13.33
     353.791     0.937500        14889        16.00
     363.775     0.943750        14986        17.78
     374.783     0.950000        15086        20.00
     389.375     0.956250        15185        22.86
     403.455     0.962500        15285        26.67
     418.815     0.968750        15382        32.00
     427.775     0.971875        15433        35.56
     437.759     0.975000        15482        40.00
     446.463     0.978125        15531        45.71
     462.079     0.981250        15581        53.33
     476.671     0.984375        15631        64.00
     487.423     0.985938        15656        71.11
     498.431     0.987500        15680        80.00
     514.559     0.989062        15705        91.43
     524.799     0.990625        15730       106.67
     543.231     0.992188        15754       128.00
     560.127     0.992969        15767       142.22
     574.975     0.993750        15779       160.00
     589.823     0.994531        15793       182.86
     601.599     0.995313        15804       213.33
     615.423     0.996094        15816       256.00
     627.711     0.996484        15823       284.44
     631.807     0.996875        15829       320.00
     642.047     0.997266        15835       365.71
     663.551     0.997656        15841       426.67
     675.327     0.998047        15848       512.00
     690.687     0.998242        15851       568.89
     705.535     0.998437        15854       640.00
     718.847     0.998633        15857       731.43
     730.623     0.998828        15860       853.33
     747.007     0.999023        15863      1024.00
     754.175     0.999121        15865      1137.78
     756.735     0.999219        15866      1280.00
     761.855     0.999316        15868      1462.86
     812.543     0.999414        15869      1706.67
     821.759     0.999512        15871      2048.00
     827.903     0.999561        15872      2275.56
     827.903     0.999609        15872      2560.00
     855.551     0.999658        15873      2925.71
     880.639     0.999707        15874      3413.33
     884.223     0.999756        15875      4096.00
     884.223     0.999780        15875      4551.11
     884.223     0.999805        15875      5120.00
     900.095     0.999829        15876      5851.43
     900.095     0.999854        15876      6826.67
     941.567     0.999878        15877      8192.00
     941.567     0.999890        15877      9102.22
     941.567     0.999902        15877     10240.00
     941.567     0.999915        15877     11702.86
     941.567     0.999927        15877     13653.33
    1047.039     0.999939        15878     16384.00
    1047.039     1.000000        15878          inf
#[Mean    =       94.947, StdDeviation   =      135.410]
#[Max     =     1046.528, Total count    =        15878]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  17873 requests in 1.50m, 20.15MB read
  Socket errors: connect 0, read 0, write 0, timeout 66
Requests/sec:    198.57  
Transfer/sec:    229.26KB