experiment/results/compare_low_RPS/no_istio_20260101_024147/wrk_logs/wrk_600rps_rep1.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 1605.476ms, rate sampling interval: 6799ms
  Thread calibration: mean lat.: 1581.531ms, rate sampling interval: 7069ms
  Thread calibration: mean lat.: 1118.430ms, rate sampling interval: 5197ms
  Thread calibration: mean lat.: 1393.067ms, rate sampling interval: 5853ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.77s     8.42s   34.24s    61.50%
    Req/Sec   100.30      6.74   118.00     74.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.37s 
 75.000%   22.15s 
 90.000%   27.39s 
 99.000%   34.24s 
 99.900%   38.24s 
 99.990%   40.53s 
 99.999%   41.45s 
100.000%   41.45s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.173     0.000000            1         1.00
    4800.511     0.100000         3241         1.11
    7389.183     0.200000         6485         1.25
    9904.127     0.300000         9724         1.43
   12787.711     0.400000        12965         1.67
   15368.191     0.500000        16197         2.00
   16613.375     0.550000        17822         2.22
   17924.095     0.600000        19459         2.50
   19365.887     0.650000        21061         2.86
   20758.527     0.700000        22680         3.33
   22151.167     0.750000        24299         4.00
   22904.831     0.775000        25107         4.44
   23691.263     0.800000        25920         5.00
   24592.383     0.825000        26728         5.71
   25378.815     0.850000        27546         6.67
   26263.551     0.875000        28361         8.00
   26820.607     0.887500        28759         8.89
   27394.047     0.900000        29165        10.00
   28033.023     0.912500        29560        11.43
   28688.383     0.925000        29967        13.33
   29392.895     0.937500        30374        16.00
   29818.879     0.943750        30575        17.78
   30228.479     0.950000        30776        20.00
   30687.231     0.956250        30986        22.86
   31145.983     0.962500        31181        26.67
   31637.503     0.968750        31382        32.00
   31916.031     0.971875        31488        35.56
   32210.943     0.975000        31585        40.00
   32489.471     0.978125        31690        45.71
   32800.767     0.981250        31789        53.33
   33177.599     0.984375        31888        64.00
   33406.975     0.985938        31941        71.11
   33718.271     0.987500        31993        80.00
   34045.951     0.989062        32040        91.43
   34373.631     0.990625        32095       106.67
   34766.847     0.992188        32145       128.00
   34963.455     0.992969        32169       142.22
   35094.527     0.993750        32192       160.00
   35422.207     0.994531        32217       182.86
   35651.583     0.995313        32244       213.33
   36044.799     0.996094        32268       256.00
   36274.175     0.996484        32282       284.44
   36569.087     0.996875        32294       320.00
   36929.535     0.997266        32307       365.71
   37355.519     0.997656        32319       426.67
   37617.663     0.998047        32336       512.00
   37683.199     0.998242        32341       568.89
   37715.967     0.998437        32344       640.00
   37879.807     0.998633        32353       731.43
   37978.111     0.998828        32357       853.33
   38305.791     0.999023        32363      1024.00
   38699.007     0.999121        32366      1137.78
   39223.295     0.999219        32369      1280.00
   39354.367     0.999316        32374      1462.86
   39419.903     0.999414        32376      1706.67
   39649.279     0.999512        32379      2048.00
   39682.047     0.999561        32380      2275.56
   40108.031     0.999609        32383      2560.00
   40108.031     0.999658        32383      2925.71
   40173.567     0.999707        32388      3413.33
   40173.567     0.999756        32388      4096.00
   40173.567     0.999780        32388      4551.11
   40173.567     0.999805        32388      5120.00
   40239.103     0.999829        32389      5851.43
   40370.175     0.999854        32390      6826.67
   40534.015     0.999878        32391      8192.00
   40534.015     0.999890        32391      9102.22
   40534.015     0.999902        32391     10240.00
   41353.215     0.999915        32392     11702.86
   41353.215     0.999927        32392     13653.33
   41418.751     0.999939        32393     16384.00
   41418.751     0.999945        32393     18204.44
   41418.751     0.999951        32393     20480.00
   41418.751     0.999957        32393     23405.71
   41418.751     0.999963        32393     27306.67
   41451.519     0.999969        32394     32768.00
   41451.519     1.000000        32394          inf
#[Mean    =    15770.686, StdDeviation   =     8419.860]
#[Max     =    41418.752, Total count    =        32394]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  36563 requests in 1.50m, 15.54MB read
Requests/sec:    406.15  
Transfer/sec:    176.72KB